### Bu hafta öğrenilicek kısımlar.
Pandas ve Serileri  
Matplotlib

### Pandas
* Pandas kütüphanesi veri analizi için kullanılır.
* Panel Data'dan gelmektedir.
* Yapısal verilerle çalışmak için kullanılır.
* Veri manipülasyonu ve analizi için yazılmuş açık kaynaklı bir Py kütüphanesidir.
* Ekonometrik ve finansal verilerle çalışmak için kullanılır.
* pip install pandas komutu ile pandas kütüphanesini kurabiliriz.

Not: Pandas serisi oluşturma pd.Series() ile pandas serisi oluşturabiliriz.

In [3]:
import pandas as pd
import numpy as np
seri=pd.Series([1,2,3,4,5,6,7,8,9])
print(seri)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [5]:
type(seri)

pandas.core.series.Series

.axes ile serinin başlangıç, bitiş ve adım değerlerini görebiliriz.

In [6]:
print(seri.axes)

[RangeIndex(start=0, stop=9, step=1)]


dtype ile serinin veri tipini görebiliriz.

In [7]:
print(seri.dtype)

int64


.size ile serinin boyutunu görebiliriz.

In [8]:
print(seri.size)

9

.ndim ile serinin boyut sayısını görebiliriz.

In [9]:
print(seri.ndim)

1


.values ile serinin değerlerini görebiliriz.

In [10]:
print(seri.values)

[1 2 3 4 5 6 7 8 9]

.head() ile serinin ilk 5 değerini görebiliriz. Eğer isterseniz .head(x) diyerek ilk x sayisının değeri görebilirsiniz.

In [11]:
seri.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
print(seri.head(3))

0    1
1    2
2    3
dtype: int64

.tail() ile serinin son 5 değerini görebiliriz. Eğer isterseniz .tail(10) diyerek son 10 değeri görebilirsiniz.

In [13]:
seri.tail()

4    5
5    6
6    7
7    8
8    9
dtype: int64

In [18]:
seri=pd.Series([99,22,332,94,5], index=["a","b","c","d","e"])
print(seri)

a     99
b     22
c    332
d     94
e      5
dtype: int64

In [15]:
print(seri["a"])

99

In [16]:
print(seri["a":"c"])

a     99
b     22
c    332
dtype: int64

In [17]:

sozluk={"reg":10, "log":11, "cart":12}
seri=pd.Series(sozluk)
seri

reg     10
log     11
cart    12
dtype: int64

In [5]:
randomNumbers=np.random.randint(10,100,5)
pandas=pd.Series(randomNumbers)
print(pandas)
print("-----")
print(pandas[0])

0    76
1    27
2    57
3    52
4    28
dtype: int32
-----
76

In [20]:
seri=pd.Series([200,121,150,99], index=["a","b","c","d"])
print(seri)

a    200
b    121
c    150
d     99
dtype: int64

In [21]:
seri.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [22]:
seri.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
seri.keys()

RangeIndex(start=0, stop=9, step=1)

In [24]:
print(list(seri.items()))

[('a', 200), ('b', 121), ('c', 150), ('d', 99)]

In [25]:
"a" in seri

True

In [26]:
"g" in seri

False

In [27]:
seri[["a","b"]]

a    200
b    121
dtype: int64

In [28]:
seri["a"]=250
print(seri)

a    250
b    121
c    150
d     99
dtype: int64

### Pandas DataFrame oluşturma pd.DataFrame()   
DataFrame oluşturabiliriz.   
Columns parametresi ile kolon isimlerini belirleyebiliriz.  
index parametresi ile index isimlerini belirleyebiliriz.

In [29]:
l=[1,2,3,4,5]
pd.DataFrame(l, columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2              3
3              4
4              5

In [7]:
m=np.arange(1,10).reshape((3,3))
pd.DataFrame(m, columns=["1","2","3"])

   1  2  3
0  1  2  3
1  4  5  6
2  7  8  9

In [31]:
df=pd.DataFrame(m, columns=["var1","var2","var3"])
df.head(2)

   var1  var2  var3
0     1     2     3
1     4     5     6

In [32]:
df.columns={"degisken1","degisken2","degisken3"}
df

   degisken2  degisken1  degisken3
0          1          2          3
1          4          5          6
2          7          8          9

In [33]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['degisken2', 'degisken1', 'degisken3'], dtype='object')]

In [34]:
df.shape # Kaça kaçlık olduğunu söyler.

(3, 3)

In [35]:
df.ndim #Kaç boyutlu onu söyler.

2

In [36]:
df.size #Eleman sayısını söyler.

9

In [37]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [38]:
df.tail(1)

   degisken2  degisken1  degisken3
2          7          8          9


### Eleman İşlemleri

In [39]:
import numpy as np
import pandas as pd
# Generating random integer arrays
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

# Creating a DataFrame from the arrays and transposing it
df = pd.DataFrame([s1, s2, s3]).transpose()

# Setting the column names
df.columns = ['s1', 's2', 's3']

# Displaying the DataFrame
print(df)

   s1  s2  s3
0   4   3   4
1   6   9   7
2   8   2   9
3   4   1   4
4   6   3   5

In [40]:
sozluk={"var1":s1, "var2":s2, "var3":s3}
df=pd.DataFrame(sozluk)

In [41]:
df

   var1  var2  var3
0     4     3     4
1     6     9     7
2     8     2     9
3     4     1     4
4     6     3     5

In [42]:
 df[0:1]

   var1  var2  var3
0     4     3     4

In [43]:
df.index=["a","b","c","d","e"]

In [44]:
df[0:1]

   var1  var2  var3
a     4     3     4

In [45]:
df["c":"e"]

   var1  var2  var3
c     8     2     9
d     4     1     4
e     6     3     5

-df.drop() ile kolon veya satır silme işlemi yapabiliriz.  
-axis=1 ile kolon silme işlemi yapabiliriz.  
-axis=0 ile satır silme işlemi yapabiliriz.  
-kalıcı bir işlem değildir sonrasında df yazılınca eski halde verir.

In [46]:
df.drop("a",axis=0)

   var1  var2  var3
b     6     9     7
c     8     2     9
d     4     1     4
e     6     3     5

In [47]:
df

   var1  var2  var3
a     4     3     4
b     6     9     7
c     8     2     9
d     4     1     4
e     6     3     5

inplace parametresi ile değişikliği kalıcı kaydetme işlemi yapabiliriz.  
Diğer durumlarda değişiklikler geçici olarak kaydedilir.

In [48]:
df.drop("a", axis=0,inplace=True)

In [49]:
df

   var1  var2  var3
b     6     9     7
c     8     2     9
d     4     1     4
e     6     3     5

In [50]:
l=["var1","var2","var3"]
for i in l:
    print(i in l)

True
True
True

In [51]:
df["var4"]=df["var1"]/df["var2"] 
df

   var1  var2  var3      var4
b     6     9     7  0.666667
c     8     2     9  4.000000
d     4     1     4  4.000000
e     6     3     5  2.000000

In [52]:
df.drop("var4", axis=1, inplace=True)
df

   var1  var2  var3
b     6     9     7
c     8     2     9
d     4     1     4
e     6     3     5

In [54]:
l=["var1","var2"]
df.drop(l,axis=1)

   var3
b     7
c     9
d     4
e     5

### Gözlem ve Değişken Seçimi

In [12]:
m=np.random.randint(1,30,size=(10,3))
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    26    21     6
1    28    18    22
2    18    23    19
3    20     9     8
4    21    23     9
5    15    26    29
6     6     6     8
7    26    26    11
8    12    19    21
9    17     7    17

loc -tanımlandığı şekliyle seçim yapmak için kullanılır.

In [13]:
df.loc[0:3]

   var1  var2  var3
0    26    21     6
1    28    18    22
2    18    23    19
3    20     9     8


iloc -alışık olduğumuz indexleme mantığıyla seçim yapmak için kullanılır.

In [14]:

df.loc[0:3]

   var1  var2  var3
0    26    21     6
1    28    18    22
2    18    23    19
3    20     9     8

In [15]:
df.iloc[0,0]

np.int32(26)

In [16]:
df.iloc[:3, :2]

   var1  var2
0    26    21
1    28    18
2    18    23

In [17]:
df.loc[0:3, "var3"]

0     6
1    22
2    19
3     8
Name: var3, dtype: int32

15:56 video